sink/openupdate/src/test/resources/mappings/mapping-UpdateService-2.0-rwqYn.json

{
  "request" : {
    "url" : "/UpdateService/2.0",
    "method" : "POST",
    "bodyPatterns" : [ {
      "equalToXml" : "<?xml version=\"1.0\" ?><S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\"><S:Body><updateRecord xmlns=\"http://oss.dbc.dk/ns/catalogingUpdate\"><updateRecordRequest><authentication><groupIdAut>010100</groupIdAut><passwordAut></passwordAut><userIdAut></userIdAut></authentication><schemaName>dbc</schemaName><bibliographicRecord><recordSchema>info:lc/xmlns/marcxchange-v1</recordSchema><recordPacking>xml</recordPacking><recordData><marcx:collection xmlns:marcx=\"info:lc/xmlns/marcxchange-v1\">\n  <marcx:record format=\"danMARC2\" type=\"Bibliographic\">\n  </marcx:record>\n</marcx:collection></recordData><extraRecordData><ns2:updateRecordExtraData xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:ns2=\"http://oss.dbc.dk/ns/updateRecordExtraData\" xsi:schemaLocation=\"http://oss.dbc.dk/ns/updateRecordExtraData\"><providerName xmlns=\"\" xmlns:ns4=\"http://oss.dbc.dk/ns/catalogingUpdate\">queue</providerName><priority xmlns=\"\" xmlns:ns4=\"http://oss.dbc.dk/ns/catalogingUpdate\">1000</priority></ns2:updateRecordExtraData></extraRecordData></bibliographicRecord><trackingId>wiremock-test</trackingId></updateRecordRequest></updateRecord></S:Body></S:Envelope>"
    } ]
  },
  "response" : {
    "status" : 200,
    "bodyFileName" : "body-UpdateService-2.0-rwqYn.json",
    "headers" : {
      "Server" : [ "GlassFish Server Open Source Edition  4.1", "grizzly/2.3.15" ],
      "X-Powered-By" : "Servlet/3.1 JSP/2.3 (GlassFish Server Open Source Edition  4.1  Java/Oracle Corporation/1.8)",
      "Content-Type" : "text/xml; charset=utf-8",
      "Date" : "Wed, 16 Nov 2016 07:56:54 GMT",
      "Transfer-Encoding" : "chunked"
    }
  }
}